In [1]:
import pandas as pd
import pyodbc
from secret import user_name

In [2]:
#db connect
server_name = 'DESKTOP-5CNJJCA\SQLEXPRESS'

user_name = user_name

conn = pyodbc.connect('Driver={SQL Server};'
                      'Server=DESKTOP-5CNJJCA\SQLEXPRESS;'
                      'Database=First_Database;'
                      'Trusted_Connection=yes;')

cursor = conn.cursor()

In [3]:
cursor = conn.cursor()
# select 26 rows from SQL table to insert in dataframe.
query = "SELECT * FROM cars;"
df = pd.read_sql(query, conn)
print(df.head(26))

h:\Python project\BS4 scrapers\Scrape class\venv\lib\site-packages\pandas\io\sql.py:761: UserWarning: pandas only support SQLAlchemy connectable(engine/connection) ordatabase string URI or sqlite3 DBAPI2 connectionother DBAPI2 objects are not tested, please consider using SQLAlchemy
  warnings.warn(

                                                title  year   price  milage  \
0                        Audi A3 1.9  TDI  Sport  2dr  2008  3850.0  105000
1                Audi A5 1.8T  FSI  160  S  Line  2dr  2009  3995.0  132000
2                          Audi TT 1.8  T  2dr  [163]  2006  3995.0   65000
3                       Audi A3 1.9  TDIe  Sport  5dr  2009  3995.0  109452
4                 Audi A4 2.0  TDi  170  S  Line  5dr  2007  3995.0  117000
5                 Audi A6 2.0  TDI  TDV  S  Line  4dr  2008  3995.0  114000
6    Audi A6 2.0  TDI  170  S  Line  Special  Ed  4dr  2010  4195.0  159000
7                          A6 2.0  TDIe  S  Line  4dr  2009  4250.0  149000
8   Audi A4 2.0  TDI  170  S  Line  4dr  [Start  S...  2009  4250.0  158000
9                       Audi A3 1.9  TDIe  Sport  3dr  2009  4250.0  145166
10       Audi A3 1.4  TFSI  Sport  5dr  [Start  Stop]  2012  4400.0  120000
11                Audi A4 2.0  TDI  143  S  Line  4dr  2009  4400.0  157000
12                     Audi A4 2.0  TDi  S  Line  2dr  2008  4450.0   91000
13  Audi A4 2.0  TDI  170  Black  Edition  4dr  [S...  2011  4450.0  178000
14                         Audi A6 2.0  TDIe  SE  4dr  2009  4495.0  119000
15                       Audi A3 1.6  TDI  Sport  5dr  2012  4495.0  102318
16                          Audi A3 1.6  TDI  SE  5dr  2010  4495.0  105000
17                     Audi A5 2.0  TDI  S  Line  5dr  2010  4500.0  179000
18                 A5 2.0  TDI  Quattro  S  Line  5dr  2011  4750.0       0
19  Audi A4 2.0  TDI  136  Black  Edition  4dr  [S...  2011  4795.0  160000
20                                                 A5  2010  4800.0  164000
21               Audi A6 2.0  TDI  170  Le  Mans  5dr  2010  4800.0  106000
22  Audi A4 2.0  TDI  136  Technik  4dr  [Start  S...  2012  4895.0  170000
23     Audi A5 2.0T  FSI  S  Line  2dr  [Start  Stop]  2010  4950.0   98000
24                     Audi A4 2.0  TDI  143  SE  5dr  2010  4950.0  119000
25  Audi A4 2.0  TDI  Quattro  170  S  Line  Speci...  2010  4995.0  139200

      transmission     fuel_type   body_style  engine_size  doors  \
0   Manual 5 speed        Diesel  Convertible          1.9      2
1   Manual 6 speed        Petrol        Coupe          1.8      2
2           Manual        Petrol  Convertible          1.8      2
3           Manual        DIESEL    Hatchback          1.9      5
4           Manual        Diesel       Estate          2.0      5
5           Manual        Diesel       Saloon          2.0      4
6           Manual        Diesel       Saloon          2.0      4
7           Manual        Diesel       Saloon          2.0      4
8           Manual        Diesel       Saloon          2.0      4
9           Manual        Diesel    Hatchback          1.9      3
10          Manual        Petrol    Hatchback          1.4      5
11          Manual        Diesel       Saloon          2.0      4
12          Manual        Diesel  Convertible          2.0      2
13          Manual        Diesel       Saloon          2.0      4
14  Manual 6 speed        Diesel       Saloon          2.0      4
15          Manual        Diesel    Hatchback          1.6      5
16          Manual        Diesel    Hatchback          1.6      5
17          Manual        Diesel    Hatchback          2.0      5
18  Manual 6 speed  Turbo Diesel    Hatchback          2.0      5
19          Manual        Diesel       Saloon          2.0      4
20          Manual        Diesel    Hatchback          2.0      4
21          Manual        Diesel       Estate          2.0      5
22          Manual        Diesel       Saloon          2.0      4
23          Manual        PETROL  Convertible          2.0      2
24          Manual        Diesel       Estate          2.0      5
25          Manual        Diesel       Saloon          2.0      4

                location         id  \
0             Ballymoney  310992852
1              Coleraine  301869183
2              Portadown  307070616
3                 Armagh  310274987
4              Portadown  310652692
5          County tyrone  311158044
6                  Newry  310991775
7               Strabane  311096454
8                  Derry  311495411
9                  Newry  311588025
10                 Coagh  306635990
11             Rasharkin  310993031
12           Londonderry  302481557
13              Strabane  309955635
14               Crumlin  305993769
15  Armagh and banbridge  309177864
16             Portadown  311280958
17        Newtownstewart  310999627
18                Claudy  311665102
19               Lisburn  310130136
20         Newtownbutler  306540853
21                 Derry  310263055
22                 Newry  311482816
23                   Moy  307936964
24            Ballyclare  309120950
25            Ballyclare  309023609

                                                 link   timestamp
0   https://www.usedcarsni.com/2008-Audi-A3-1-9-TD...  2022-12-04
1   https://www.usedcarsni.com/2009-Audi-A5-1-8T-F...  2022-12-04
2   https://www.usedcarsni.com/2006-Audi-TT-1-8-T-...  2022-12-04
3   https://www.usedcarsni.com/2009-Audi-A3-1-9-TD...  2022-12-04
4   https://www.usedcarsni.com/2007-Audi-A4-2-0-TD...  2022-12-04
5   https://www.usedcarsni.com/2008-Audi-A6-2-0-TD...  2022-12-04
6   https://www.usedcarsni.com/2010-Audi-A6-2-0-TD...  2022-12-04
7   https://www.usedcarsni.com/2009-Audi-A6-2-0-TD...  2022-12-04
8   https://www.usedcarsni.com/2009-Audi-A4-2-0-TD...  2022-12-04
9   https://www.usedcarsni.com/2009-Audi-A3-1-9-TD...  2022-12-04
10  https://www.usedcarsni.com/2012-Audi-A3-1-4-TF...  2022-12-04
11  https://www.usedcarsni.com/2009-Audi-A4-2-0-TD...  2022-12-04
12  https://www.usedcarsni.com/2008-Audi-A4-2-0-TD...  2022-12-04
13  https://www.usedcarsni.com/2011-Audi-A4-2-0-TD...  2022-12-04
14  https://www.usedcarsni.com/2009-Audi-A6-2-0-TD...  2022-12-04
15  https://www.usedcarsni.com/2012-Audi-A3-1-6-TD...  2022-12-04
16  https://www.usedcarsni.com/2010-Audi-A3-1-6-TD...  2022-12-04
17  https://www.usedcarsni.com/2010-Audi-A5-2-0-TD...  2022-12-04
18  https://www.usedcarsni.com/2011-Audi-A5-2-0-TD...  2022-12-04
19  https://www.usedcarsni.com/2011-Audi-A4-2-0-TD...  2022-12-04
20  https://www.usedcarsni.com/2010-Audi-A5-306540853  2022-12-04
21  https://www.usedcarsni.com/2010-Audi-A6-2-0-TD...  2022-12-04
22  https://www.usedcarsni.com/2012-Audi-A4-2-0-TD...  2022-12-04
23  https://www.usedcarsni.com/2010-Audi-A5-2-0T-F...  2022-12-04
24  https://www.usedcarsni.com/2010-Audi-A4-2-0-TD...  2022-12-04
25  https://www.usedcarsni.com/2010-Audi-A4-2-0-TD...  2022-12-04

In [4]:
df['make'] = 'Audi'
df['model'] = ''

In [5]:
df.drop_duplicates(inplace=True, subset=['id'], keep='last')
df = df[df['price'] !=0]
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11127 entries, 27 to 116959
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         11127 non-null  object
 1   year          11127 non-null  int64
 2   price         11127 non-null  float64
 3   milage        11127 non-null  int64
 4   transmission  11127 non-null  object
 5   fuel_type     11127 non-null  object
 6   body_style    11127 non-null  object
 7   engine_size   11127 non-null  float64
 8   doors         11127 non-null  int64
 9   location      11127 non-null  object
 10  id            11127 non-null  object
 11  link          11127 non-null  object
 12  timestamp     11127 non-null  object
 13  make          11127 non-null  object
 14  model         11127 non-null  object
dtypes: float64(2), int64(3), object(10)
memory usage: 956.2+ KB

In [6]:
models = ['A1', 'A2', 'A3', 'A4', 'A5', 'A6', 'A7', 'A8', 'TT', 'Q2', 'Q3', 'Q4','Q5','Q6', 'Q7', 'Q8','S3','S4','RS3','RS4','RS5','RS6','RS7','R8','E-Tron']

def add_model(model):
    a6 = df['title'].str.contains(model)
    df.loc[a6,'model'] = model
    print(f'{model} done')

for model in models:
    add_model(model)

A1 done
A2 done
A3 done
A4 done
A5 done
A6 done
A7 done
A8 done
TT done
Q2 done
Q3 done
Q4 done
Q5 done
Q6 done
Q7 done
Q8 done
S3 done
S4 done
RS3 done
RS4 done
RS5 done
RS6 done
RS7 done
R8 done
E-Tron done

In [7]:
new = df[df['price'] != 0 ]
new = new[df['milage'] != 0]
new.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11082 entries, 27 to 116959
Data columns (total 15 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   title         11082 non-null  object
 1   year          11082 non-null  int64
 2   price         11082 non-null  float64
 3   milage        11082 non-null  int64
 4   transmission  11082 non-null  object
 5   fuel_type     11082 non-null  object
 6   body_style    11082 non-null  object
 7   engine_size   11082 non-null  float64
 8   doors         11082 non-null  int64
 9   location      11082 non-null  object
 10  id            11082 non-null  object
 11  link          11082 non-null  object
 12  timestamp     11082 non-null  object
 13  make          11082 non-null  object
 14  model         11082 non-null  object
dtypes: float64(2), int64(3), object(10)
memory usage: 952.4+ KB

In [8]:
new.to_csv('models.csv')

In [10]:
drop = "DROP TABLE cars_clean"
cursor.execute(drop)
cursor.commit()

sql = """
    CREATE TABLE [cars_clean](
        title varchar(225), 
        year int,  
        price float,
        milage int,  
        transmission varchar(50), 
        fuel_type varchar(50), 
        body_style varchar(50), 
        engine_size float,
        doors int,  
        location varchar(50),
        id varchar(50),
        link varchar(250),
        timestamp date,
        make varchar(50),
        model varchar(50)
    )
"""

cursor.execute(sql)
cursor.commit()

In [11]:
# Insert Dataframe into SQL Server:

for index, row in df.iterrows():
     cursor.execute("""INSERT INTO cars_clean (title,year, price,milage,transmission,fuel_type,body_style,engine_size,doors,location,id,link,timestamp,make,model) 
    values(?,?,?,?,?,?,?,?,?,?,?,?,?,?,?)
""", row.title, row.year, row.price, row.milage,row.transmission,row.fuel_type,row.body_style,row.engine_size,row.doors,row.location,row.id,row.link,row.timestamp,row.make,row.model)
conn.commit()
cursor.close()

In [12]:
conn.close()